{"version":"1.0","truncation":{"max_length":512,"strategy":"LongestFirst","stride":0},"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<PAD>"},"added_tokens":[{"id":0,"special":true,"content":"<PAD>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<BOS>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"<EOS>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":{"type":"NFKC"},"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"post_processor":null,"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<PAD>":0,"<BOS>":1,"<EOS>":2,"*":3,"1":4,"2":5,"A":6,"B":7,"C":8,"D":9,"E":10,"F":11,"G":12,"H":13,"I":14,"J":15,"K":16,"L":17,"M":18,"N":19,"O":20,"P":21,"Q":22,"R":23,"S":24,"T":25,"U":26,"V":27,"W":28,"X":29,"Y":30,"Z":31,"Ġ":32},"merges":[]}}